# EXL_NewBook

## Description
Create a new Excel file.

```pascal
FUNCTION EXL_NewBook(filePath : STRING) : BOOLEAN;
```

```python

def vs.EXL_NewBook(filePath):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|filePath|STRING||

## Version
Availability: from Vectorworks 2021
## Category
* Excel